EuphonistiHack/marble-maze/TivaWare_c_Series-1.0/examples/boards/ek-tm4c123gxl-boostxl-senshub/maze_transmitter/lprf.c
//*****************************************************************************
//
// lprf.c - Implementation of the applications low power radio frequency
// interface.
//
// Copyright (c) 2012-2013 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
//
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
//
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
//
// This is part of revision 1.0 of the EK-TM4C123GXL Firmware Package.
//
//*****************************************************************************

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_ints.h"
#include "driverlib/pin_map.h"
#include "driverlib/gpio.h"
#include "driverlib/sysctl.h"
#include "driverlib/rom.h"
#include "driverlib/interrupt.h"
#include "drivers/rgb.h"
#include "driverlib/timer.h"
#include "remoti_uart.h"
#include "remoti_npi.h"
#include "remoti_rti.h"
#include "remoti_rtis.h"
#include "remoti_zid.h"
#include "usblib/usblib.h"
#include "usblib/usbhid.h"
#include "usblib/device/usbdevice.h"
#include "usblib/device/usbdcomp.h"
#include "usblib/device/usbdhid.h"
#include "usblib/device/usbdhidmouse.h"
#include "usblib/device/usbdhidkeyb.h"
#include "utils/uartstdio.h"
#include "drivers/buttons.h"
#include "events.h"
#include "motion.h"

#include "nodeConfig.h"

#if  !defined (DEV_IS_CONTROLLER)  && !defined (DEV_IS_TARGET)
#error
#endif

//*****************************************************************************
//
// Global array that contains the colors of the RGB.  Low power RF is assigned
// green.
//
// Slow blinking means trying to pair.
// Solid means paired.
// Quick blinks occur when data is transmitted.  (Light off on transmit attempt
// light on when transmit attempt is complete).
// off not paired.
//
//*****************************************************************************
extern volatile uint32_t g_pui32RGBColors[3];


//*****************************************************************************
//
// Global storage to count blink ticks.  This sets blink timing after error.
//
//*****************************************************************************
uint32_t g_ui32RGBLPRFBlinkCounter;

//*****************************************************************************
//
// Global storage for buttons state of previous LPRF packet
//
//*****************************************************************************
uint_fast8_t g_ui8LPRFButtonsPrev;

//*****************************************************************************
//
// Current state of the LPRF network link.
//
//*****************************************************************************
volatile uint_fast8_t g_vui8LinkState;

//*****************************************************************************
//
// The index into our pairing table that contains the current active link.
//
//*****************************************************************************
uint8_t g_ui8LinkDestIndex;

uint8_t g_ui8Sending;

//*****************************************************************************
//
// Link States.
//
//*****************************************************************************
enum
{
  LINK_STATE_INIT,
  LINK_STATE_READY,
  LINK_STATE_PAIR,
  LINK_STATE_NDATA,
  LINK_STATE_UNPAIR,
  LINK_STATE_TEST,
  LINK_STATE_TEST_COMPLETED,
  LINK_STATE_OAD
};

//*****************************************************************************
//
// Global variables to hold key presses and hold information.
//
//*****************************************************************************
tZIDKeyboardData g_sZIDKeys;
bool g_bModifierHold;
bool g_bKeyHold;
bool g_bPressed;

//*****************************************************************************
//
// List of implemented device types.
//
//*****************************************************************************
const uint8_t pui8DevList[RTI_MAX_NUM_DEV_TYPES] =
{
#ifdef DEV_IS_CONTROLLER
	RTI_DEVICE_REMOTE_CONTROL,
#else
	RTI_DEVICE_TELEVISION,
#endif
	RTI_DEVICE_RESERVED_INVALID,
	RTI_DEVICE_RESERVED_INVALID
};

//*****************************************************************************
//
// List of implemented profiles.
//
//*****************************************************************************
const uint8_t pui8ProfileList[RTI_MAX_NUM_PROFILE_IDS] =
{
    RTI_PROFILE_ZRC, 0, 0, 0, 0, 0, 0
};

//*****************************************************************************
//
// List of possible target types.
//
//*****************************************************************************
const unsigned char pucTargetList[RTI_MAX_NUM_SUPPORTED_TGT_TYPES] =
{
#ifndef DEV_IS_CONTROLLER
	RTI_DEVICE_REMOTE_CONTROL,
#endif
	RTI_DEVICE_TELEVISION,
    RTI_DEVICE_SET_TOP_BOX,
    RTI_DEVICE_MEDIA_CENTER_PC,
    RTI_DEVICE_GAME_CONSOLE,
    RTI_DEVICE_MONITOR
#ifdef DEV_IS_CONTROLLER
    ,RTI_DEVICE_RESERVED_INVALID
#endif
};

//*****************************************************************************
//
// String version of Vendor Name.
//
//*****************************************************************************
const unsigned char pui8VendorName[]="TI-LPRF";

//*****************************************************************************
//
// Determine type of reset to issue based on user buttons presses.
// No buttons will cause a restore of all previous state values.
// Left button press will clear state information but not configuration.
// Right button will clear state information and configuration.
//
// Reset the RNP by toggling the RF modules external reset line.
//
//*****************************************************************************
void
ZIDResetRNP(void)
{
    //
    // Assert reset to the RNP.
    //
    ROM_GPIOPinWrite(GPIO_PORTC_BASE, GPIO_PIN_7, 0);

    //
    // Hold reset low for about 8 milliseconds to verify reset is detected
    //
    ROM_SysCtlDelay(ROM_SysCtlClockGet() / (125 * 3));

    //
    //Release reset to the RNP
    //
    ROM_GPIOPinWrite(GPIO_PORTC_BASE, GPIO_PIN_7, GPIO_PIN_7);

    //
    // Delay to allow RNP to do its internal boot.
    //
    ROM_SysCtlDelay(ROM_SysCtlClockGet() / (2 * 3));

