EuphonistiHack/marble-maze/TivaWare_c_Series-1.0/examples/boards/ek-tm4c123gxl-boostxl-senshub/maze_transmitter/lprf.c
}

//*****************************************************************************
//
// Based on desired restoration setting, configure the RNP parameters for this
// application.
//
//*****************************************************************************
void
ZIDConfigParams(void)
{
    uint8_t pui8Value[MAX_AVAIL_DEVICE_TYPES];
    volatile uint8_t ui8Status;
    uint8_t ui8Tmp;

    g_ui8Sending = 0;
    UARTprintf("start config\n");

    pui8Value[0] = eRTI_CLEAR_STATE;

    //
    // Execute the desired startup control setting. Clears or restore based on
    // button status.
    //
    ui8Status = RTI_WriteItem(RTI_CP_ITEM_STARTUP_CTRL, 1, pui8Value);
    if(ui8Status != RTI_SUCCESS)
    {
    	UARTprintf("Err init: wr startup ctrl\n");
    }

    //
    // If we successfully read the startup control value and it is not set to
    // restore the previous state then we need to re-configure the RNP.
    // If we are set to RESTORE then we can skip this configuration section.
    //
    if((ui8Status == RTI_SUCCESS)  && (pui8Value[0] != eRTI_RESTORE_STATE))
    {
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_NODE_SUPPORTED_TGT_TYPES,
                                 RTI_MAX_NUM_SUPPORTED_TGT_TYPES,
                                 pucTargetList);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr supp tgt types\n");
        }

        //
        // Application capabilities is a bit field that the application must
        // configure. It defines number of devices and profiles that this
        // node will be presenting to the network.
        //
        ui8Tmp = 0x12;
        ui8Status = RTI_WriteItem( RTI_CP_ITEM_APPL_CAPABILITIES, 1, &ui8Tmp);
        if (ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr appl cap\n");
        }

        //
        // Write the list of supported device types to the RNP
        //
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_APPL_DEV_TYPE_LIST,
                                 RTI_MAX_NUM_DEV_TYPES, pui8DevList);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr dev type list\n");
        }

        //
        // Write the list of supported profiles to the RNP.
        //
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_APPL_PROFILE_ID_LIST,
                                 RTI_MAX_NUM_PROFILE_IDS, pui8ProfileList);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr supp prof types\n");
        }

        //
        // Node capabilities is a bit field that controls security, power
        // and other node characteristics.
        //
#ifdef DEV_IS_CONTROLLER
        ui8Tmp = 0x06;
#else
        ui8Tmp = 0x07;
#endif
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_NODE_CAPABILITIES, 1, &ui8Tmp);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr node caps\n");
        }

        //
        // Write the Vendor ID number to the RNP.
        //
        pui8Value[0] = (uint8_t) (RTI_VENDOR_TEXAS_INSTRUMENTS & 0xFF);
        pui8Value[1] = (uint8_t) ((RTI_VENDOR_TEXAS_INSTRUMENTS >> 8) & 0xFF);
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_VENDOR_ID, 2, pui8Value);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr vendor ID\n");
        }

        ui8Status = RTI_ReadItem(RTI_CP_ITEM_VENDOR_ID, 2, pui8Value);
        if(ui8Status == RTI_SUCCESS )
        {
            UARTprintf("Vendor ID: %d,%d\n", pui8Value[0], pui8Value[1]);
        }
        else
        {
        	UARTprintf("Err reading vendor ID!\n");
        }

        //
        // Write the string version of vendor name to the RNP.
        //
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_VENDOR_NAME,
                                 sizeof(pui8VendorName), pui8VendorName);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr vendor name\n");
        }

        ui8Status = RTI_ReadItem(RTI_CP_ITEM_VENDOR_ID, 2, pui8Value);
		if(ui8Status == RTI_SUCCESS )
		{
			UARTprintf("aVendor ID: %d,%d\n", pui8Value[0], pui8Value[1]);
		}
		else
		{
			UARTprintf("Err reading vendor ID!\n");
		}

        //
        // Write the desired standby duty cycle to the RNP.
        //
        pui8Value[0] = (uint8_t) (1000 & 0xFF);
        pui8Value[1] = (uint8_t) (1000 >> 8);
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_STDBY_DEFAULT_DUTY_CYCLE, 2,
                                 pui8Value);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr stdby duty cycle\n");
        }
        ui8Status = RTI_ReadItem(RTI_CP_ITEM_VENDOR_ID, 2, pui8Value);
		if(ui8Status == RTI_SUCCESS )
		{
			UARTprintf("bVendor ID: %d,%d\n", pui8Value[0], pui8Value[1]);
		}
		else
		{
			UARTprintf("Err reading vendor ID!\n");
		}
        UARTprintf("All conf written\n");
    }

    UARTprintf("end config\n");
}

//*****************************************************************************
//
// RTI Confirm function. Confirms the receipt of an Init Request (RTI_InitReq).
//
// Called by RTI_AsynchMsgProcess which we have placed in the main application
// context.
//
//*****************************************************************************
void
RTI_InitCnf(uint8_t ui8Status)
{
    uint8_t ui8MaxEntries, ui8Value;
	uint8_t pui8Value[MAX_AVAIL_DEVICE_TYPES];

    ui8Status = RTI_ReadItem(RTI_CP_ITEM_VENDOR_ID, 2, pui8Value);
	if(ui8Status == RTI_SUCCESS )
	{
		UARTprintf("1Vendor ID: %d,%d\n", pui8Value[0], pui8Value[1]);
	}
	else
	{
		UARTprintf("Err reading vendor ID!\n");
	}

    UARTprintf("init hit cnf\n");
    //
    // Verify return status.
    //
    if (ui8Status == RTI_SUCCESS)
    {
        //
        // Make sure startup control is now set back to RESTORE mode.
        //
        ui8Value = eRTI_RESTORE_STATE;
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_STARTUP_CTRL, 1, &ui8Value);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("write startupctrl fail\n");
        }

        ui8Status = RTI_ReadItem(RTI_CP_ITEM_VENDOR_ID, 2, pui8Value);
		if(ui8Status == RTI_SUCCESS )
		{
			UARTprintf("2Vendor ID: %d,%d\n", pui8Value[0], pui8Value[1]);
		}
		else
		{
			UARTprintf("Err reading vendor ID!\n");
		}
        //
        // Determine the maximum number of pairing table entries.
        //
        ui8Status = RTI_ReadItemEx(RTI_PROFILE_RTI,
                                  RTI_CONST_ITEM_MAX_PAIRING_TABLE_ENTRIES,
                                  1, &ui8MaxEntries);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("read max table entries fail\n");
        }

        //
        // Verify that read was successful.
        //
        if(ui8Status == RTI_SUCCESS)
        {
			//
			// Delay briefly so we don't overrun the RPI buffers.
			//
			ROM_SysCtlDelay(ROM_SysCtlClockGet() / (100*3));

			//
			// Send a Disable Sleep Request.  This will wake up the RPI
			// and then start a pairing sequence.
			//
			RTI_DisableSleepReq();

			//
			// Set the link state to pairing in process
			//
			g_vui8LinkState = LINK_STATE_PAIR;
			g_ui32RGBLPRFBlinkCounter = g_ui32SysTickCount;
        }
    }
    else
    {
    	UARTprintf("Err!  initcnf called w/o succes: 0x%02x\n", ui8Status);
    }

