EuphonistiHack/marble-maze/TivaWare_c_Series-1.0/examples/boards/ek-tm4c123gxl-boostxl-senshub/maze_transmitter/lprf.c
}

//*****************************************************************************
//
// RTI confirm function. Called by RTI_AsynchMsgProcess when a pairing
// request is confirmed.  Contains the status of the pairing attempt and
// if successful the destination index.
//
//*****************************************************************************
void
RTI_PairCnf(uint8_t ui8Status, uint8_t ui8DestIndex,
            uint8_t ui8DevType)
{
    //
    // The maze side uses AllowPairReq, not InitPairReq, as it is the target in
    // this case.  As such, PairReq shouldn't be called, so paircnf does nada
    //
#ifdef DEV_IS_CONTROLLER

    static uint8_t sui8Tx[8];
    uint8_t ui8TXOptions = 0;
    //
    // Determine if the Pair attempt was successful.
    //
    if(ui8Status == RTI_SUCCESS)
    {
    	UARTprintf("paired!\n");
        //
        // Save the destination index we got back from our successful pairing.
        // Write that value back to the RNP so it knows this is the current
        // link to be used.
        //
        g_ui8LinkDestIndex = ui8DestIndex;
        ui8Status = RTI_WriteItemEx(RTI_PROFILE_RTI,
                                    RTI_SA_ITEM_PT_CURRENT_ENTRY_INDEX, 1,
                                    &g_ui8LinkDestIndex);

        //
        // Turn on the LED to show we paired and ready.
        //
        g_pui32RGBColors[GREEN] = 0x0;
        RGBColorSet(g_pui32RGBColors);

        sui8Tx[0] = 'h';

        RTI_SendDataReq(g_ui8LinkDestIndex, RTI_PROFILE_ZRC,
						RTI_VENDOR_TEXAS_INSTRUMENTS, ui8TXOptions,
						1, sui8Tx);

    }

    else
    {
    	UARTprintf("tried to pair, failed: 0x%02x\n", ui8Status);
        //
        // Turn off the LED to show pairing failed.
        //
        g_pui32RGBColors[GREEN] = 0;
        RGBColorSet(g_pui32RGBColors);
    }

    g_vui8LinkState = LINK_STATE_READY;
#endif
}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess if pairing was aborted.
// Currently not expected to get this call so just set the link state back to
// ready.
//
//*****************************************************************************
void
RTI_PairAbortCnf(uint8_t ui8Status)
{
    (void) ui8Status;

    //
    // Reset the link state.
    //
    if (LINK_STATE_PAIR == g_vui8LinkState)
    {
        g_vui8LinkState = LINK_STATE_READY;
    }
}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess when an allow pair
// request is recieved by the application processor.  This is not expected for
// this application.
//
//*****************************************************************************
void
RTI_AllowPairCnf(uint8_t ui8Status, uint8_t ui8DestIndex,
                 uint8_t ui8DevType)
{
    //
    // Do nothing. Controller does not trigger AllowPairReq() and hence is not
    // expecting this callback.
    //
    (void) ui8Status;


#ifdef DEV_IS_TARGET
    //
    // For maze_host, we are the target, so our pairing callback is
    // AllowPairCnf, not PairCnf.
    //

	//
	// Determine if the Pair attempt was successful.
	//
	if(ui8Status == RTI_SUCCESS)
	{
	UARTprintf("paired!\n");
	   //
	   // Save the destination index we got back from our successful pairing.
	   // Write that value back to the RNP so it knows this is the current
	   // link to be used.
	   //
	   g_ui8LinkDestIndex = ui8DestIndex;
	   ui8Status = RTI_WriteItemEx(RTI_PROFILE_RTI,
								   RTI_SA_ITEM_PT_CURRENT_ENTRY_INDEX, 1,
								   &g_ui8LinkDestIndex);

	   //
	   // Turn on the LED to show we paired and ready.
	   //
	   g_pui32RGBColors[GREEN] = 0x4000;
	   RGBColorSet(g_pui32RGBColors);
	}

	else
	{
	UARTprintf("tried to pair, failed: 0x%02x\n", ui8Status);
	   //
	   // Turn off the LED to show pairing failed.
	   //
	   g_pui32RGBColors[GREEN] = 0;
	   RGBColorSet(g_pui32RGBColors);
	}

	g_vui8LinkState = LINK_STATE_READY;
#endif
}

//*****************************************************************************
//
// RTI Confirm function.  Called by RTI_AsyncMsgProcess when a unpair request
// is confirmed by the RNP. Currently not implemented.
//
//*****************************************************************************
void
RTI_UnpairCnf(uint8_t ui8Status, uint8_t ui8DestIndex)
{
    //
    // unused arguments
    //
    (void) ui8Status;
    (void) ui8DestIndex;
}

//*****************************************************************************
//
// RTI indication function. Called by RTI_AsynchMsgProcess when the far side of
// the link is requesting to unpair. Currently not implemented.
//
//
//*****************************************************************************
void
RTI_UnpairInd(uint8_t ui8DestIndex)
{

    //
    // unused arguments
    //
    (void) ui8DestIndex;
}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess when a data send is
// confirmed. It is now clear to queue the next data packet.
//
//*****************************************************************************
void
RTI_SendDataCnf(uint8_t ui8Status)
{

	if(ui8Status != RTI_SUCCESS)
	{
		UARTprintf("senddatacnf error! 0x%02x\n", ui8Status);
	}
	//UARTprintf("data sent\n");

    //
    // Set the link state to ready.
    //
    if (g_vui8LinkState == LINK_STATE_NDATA)
    {
        g_vui8LinkState = LINK_STATE_READY;
    }

    //
    // Turn on the LED to show we are back to ready state.
    //
    g_pui32RGBColors[GREEN] = 0;
    RGBColorSet(g_pui32RGBColors);
    g_ui8Sending = 0;
}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess when the RxEnable
// request has been processed by the RNP. Not implemented.
//
//*****************************************************************************
void
RTI_RxEnableCnf(uint8_t ui8Status)
{
    //
    // Do nothing
    //
    (void) ui8Status;

