EuphonistiHack/marble-maze/TivaWare_c_Series-1.0/examples/boards/ek-tm4c123gxl-boostxl-senshub/maze_transmitter/lprf.c
}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess when the enable sleep
// request has been proccessed by the RNP.
//
//*****************************************************************************
void
RTI_EnableSleepCnf(uint8_t ui8Status)
{
    //
    // Do nothing
    //
    (void) ui8Status;
}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess when disable sleep
// request has been processed by the RNP. This is used during the init sequence
// as a trigger to start a pairing sequence if needed.
//
//*****************************************************************************
void
RTI_DisableSleepCnf(uint8_t ui8Status)
{
	uint8_t pui8Value[MAX_AVAIL_DEVICE_TYPES];
    (void) ui8Status;

    ui8Status = RTI_ReadItem(RTI_CP_ITEM_VENDOR_ID, 2, pui8Value);
	if(ui8Status == RTI_SUCCESS )
	{
		UARTprintf("3Vendor ID: %d,%d\n", pui8Value[0], pui8Value[1]);
	}
	else
	{
		UARTprintf("Err reading vendor ID!\n");
	}

    //
    // RNP is now awake, if we don't have a pairing link then start the pair
    // process.
    //
    if(g_ui8LinkDestIndex == RTI_INVALID_PAIRING_REF)
    {
#ifdef DEV_IS_CONTROLLER
    	UARTprintf("hitting PairReq\n");
		RTI_PairReq();
#else
    	UARTprintf("hitting AllowPairReq\n");
        RTI_AllowPairReq();
#endif
    }
}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess when the RNP would
// like to get the latest report data from the application processor.
//
//*****************************************************************************
void
RTI_ReceiveDataInd(uint8_t ui8SrcIndex, uint8_t ui8ProfileId,
                   uint16_t ui16VendorID, uint8_t ui8RXLinkQuality,
                   uint8_t ui8RXFlags, uint8_t ui8Length, uint8_t *pui8Data)
{
	int i;

	UARTprintf("rxd len %d: ", ui8Length);
	for(i=0;i<ui8Length;i++)
	{
		UARTprintf("0x%02x ", pui8Data[i]);
	}

#ifdef DEV_IS_CONTROLLER
#if 0
    static int16_t i16RPYData[3];

    MotionGetRPY(i16RPYData, i16RPYData+1, i16RPYData+2);

    if(pui8Data[0] == 0xA5)
    {
    	UARTprintf("Ack\n");
    	i16RPYData[0] = 0x1234;
    	RTI_SendDataReq(g_ui8LinkDestIndex, RTI_PROFILE_ZRC,
						RTI_VENDOR_TEXAS_INSTRUMENTS, ui8TXOptions, 2,//6,
						(uint8_t *)i16RPYData);
    }
#endif
#else
    static uint8_t ui8Ack = 0xA5;
    int16_t i16Roll, i16Pitch, i16Yaw;

    i16Roll = pui8Data[0] & (pui8Data[1] << 8);
    i16Pitch = pui8Data[2] & (pui8Data[3] << 8);
    i16Yaw = pui8Data[4] & (pui8Data[5] << 8);

    UARTprintf("Roll: %4d, Pitch: %4d, Yaw: %4d\n", i16Roll, i16Pitch, i16Yaw);

    RTI_SendDataReq(g_ui8LinkDestIndex, RTI_PROFILE_ZRC,
					RTI_VENDOR_TEXAS_INSTRUMENTS, ui8TXOptions, 1, &ui8Ack);
#endif
}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess when a standby request
// has been processed by the RNP.
//
//*****************************************************************************
void
RTI_StandbyCnf(uint8_t ui8Status)
{

    (void) ui8Status;

}

//*****************************************************************************
//
// RTI Callback function. The lower level UART and NPI layers have verified
// received an asynchronous message. Set the flag to indicate it needs
// processed.
//
//*****************************************************************************
void
RTI_AsynchMsgCallback(uint32_t ui32Data)
{
    (void) ui32Data;

    //
    // Set the flag to tell LPRF Main that we need to process a message.
    //
    HWREGBITW(&g_ui32Events, LPRF_EVENT) = 1;
}


//*****************************************************************************
//
//
//*****************************************************************************
void
RTI_AsynchMsgProcess(void)
{
    tRemoTIMsg sMsg;

    //
    // Get the msg from the UART low level driver
    //
    RemoTIUARTGetMsg((uint8_t *) &sMsg, NPI_MAX_DATA_LEN);

    if ((sMsg.ui8SubSystem & 0x1F) == RPC_SYS_RCAF)
    {
        switch((unsigned long) sMsg.ui8CommandID)
        {
            case RTIS_CMD_ID_RTI_INIT_CNF:
                RTI_InitCnf(sMsg.pui8Data[0]);
                break;

            case RTIS_CMD_ID_RTI_PAIR_CNF:
                RTI_PairCnf(sMsg.pui8Data[0], sMsg.pui8Data[1], sMsg.pui8Data[2]);
                break;

            case RTIS_CMD_ID_RTI_PAIR_ABORT_CNF:
                RTI_PairAbortCnf(sMsg.pui8Data[0]);
                break;

            case RTIS_CMD_ID_RTI_ALLOW_PAIR_CNF:
                RTI_AllowPairCnf(sMsg.pui8Data[0], sMsg.pui8Data[1],
                                 sMsg.pui8Data[2]);
                break;

            case RTIS_CMD_ID_RTI_SEND_DATA_CNF:
                RTI_SendDataCnf(sMsg.pui8Data[0]);
                break;

            case RTIS_CMD_ID_RTI_REC_DATA_IND:
                RTI_ReceiveDataInd(sMsg.pui8Data[0], sMsg.pui8Data[1],
                                   sMsg.pui8Data[2] | (sMsg.pui8Data[3] << 8),
                                   sMsg.pui8Data[4], sMsg.pui8Data[5],
                                   sMsg.pui8Data[6], &sMsg.pui8Data[7]);
                break;

            case RTIS_CMD_ID_RTI_STANDBY_CNF:
                RTI_StandbyCnf(sMsg.pui8Data[0] );
                break;

            case RTIS_CMD_ID_RTI_ENABLE_SLEEP_CNF:
                RTI_EnableSleepCnf(sMsg.pui8Data[0] );
                break;

            case RTIS_CMD_ID_RTI_DISABLE_SLEEP_CNF:
                RTI_DisableSleepCnf(sMsg.pui8Data[0] );
                break;

            case RTIS_CMD_ID_RTI_RX_ENABLE_CNF:
                RTI_RxEnableCnf(sMsg.pui8Data[0] );
                break;

            case RTIS_CMD_ID_RTI_UNPAIR_CNF:
                RTI_UnpairCnf(sMsg.pui8Data[0], sMsg.pui8Data[1]);
                break;

            case RTIS_CMD_ID_RTI_UNPAIR_IND:
                RTI_UnpairInd(sMsg.pui8Data[0]);
                break;

            default:
                // nothing can be done here!
                break;
        }
    }
}

//*****************************************************************************
//
//
//*****************************************************************************
void
LPRFInit(void)
{
    //
    // Enable the RemoTI UART pin muxing.
    // UART init is done in the RemoTI/uart_drv functions
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
    ROM_GPIOPinConfigure(GPIO_PB0_U1RX);
    ROM_GPIOPinConfigure(GPIO_PB1_U1TX);
    ROM_GPIOPinTypeUART(GPIO_PORTB_BASE, GPIO_PIN_0 | GPIO_PIN_1);

    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_UART1);

    //
    // Configure the CC2533 Reset pin
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTC_BASE, GPIO_PIN_7);

    g_ui8LinkDestIndex = RTI_INVALID_PAIRING_REF;

    RemoTIUARTInit(UART1_BASE);
    IntEnable(INT_UART1);

    NPI_Init(RTI_AsynchMsgCallback);
    RTI_Init();

    ZIDResetRNP();
    ZIDConfigParams();
    RTI_InitReq();
}

//*****************************************************************************
//
//
//*****************************************************************************
void
LPRFMain(void)
{
#if 0
    int8_t i8DeltaX, i8DeltaY;
    uint8_t ui8Buttons;
    bool bSendIt, bButtonChange;
#endif
    uint8_t ui8TXOptions = 0;
    static char pucOutStr[64];

    //
    // First determine if we need to process a asynchronous message, such as
    // a send data confirmation or pairing confirmation.
    //
    while(HWREGBITW(&g_ui32Events, LPRF_EVENT) != 0)
    {
        //
        // Processes the message and calls the appropriate RTI callback.
        //
        RTI_AsynchMsgProcess();

        //
        // Clear the event flag.
        //
        if(RemoTIUARTGetRxMsgCount() == 0)
        {
            HWREGBITW(&g_ui32Events, LPRF_EVENT) = 0;
        }
    }

    if(g_vui8LinkState == LINK_STATE_PAIR)
    {
        //
        // Pairing in process so do a steady quick blink of the LED.
        //
        if(g_ui32SysTickCount > (g_ui32RGBLPRFBlinkCounter + 20))
        {
            //
            // 20 ticks have expired since we last toggled so turn off the
            // LED and reset the counter.
            //
            g_ui32RGBLPRFBlinkCounter = g_ui32SysTickCount;
            g_pui32RGBColors[GREEN] = 0;
            RGBColorSet(g_pui32RGBColors);
        }
        else if(g_ui32SysTickCount == (g_ui32RGBLPRFBlinkCounter + 10))
        {
            //
            // 10 ticks have expired since the last counter reset.  turn
            // on the green LED.
            //
            g_pui32RGBColors[GREEN] = 0x4000;
            RGBColorSet(g_pui32RGBColors);
        }
    }
    else if(g_vui8LinkState == LINK_STATE_READY)
    {
    	//
    	// We are connected, turn on the green LED
    	//
    	g_pui32RGBColors[GREEN] = 0x4000;
    	g_pui32RGBColors[RED] = 0;
    	RGBColorSet(g_pui32RGBColors);

#ifdef DEV_IS_CONTROLLER
    static int16_t i16RPYData[3];

    if(!g_ui8Sending)
    {
		MotionGetRPY(i16RPYData, i16RPYData+1, i16RPYData+2);
		sprintf(pucOutStr, "%05d %05d %05d", i16RPYData[0], i16RPYData[1], i16RPYData[2]);
		UARTprintf("%s, len %d\n", pucOutStr, strlen(pucOutStr));
		RTI_SendDataReq(g_ui8LinkDestIndex, RTI_PROFILE_ZRC,
						RTI_VENDOR_TEXAS_INSTRUMENTS, ui8TXOptions, strlen(pucOutStr),
						(uint8_t *)pucOutStr);
		TimerLoadSet(TIMER4_BASE, TIMER_A, 40000000/10);
		TimerEnable(TIMER4_BASE, TIMER_A);
		g_ui8Sending = 1;
    }
#endif
    }
}
